In [1]:
! pip install numpy

Requirement already satisfied: numpy in c:\users\menna\anaconda3\lib\site-packages (2.1.3)

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\menna\anaconda3\lib\site-packages (2.2.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.26.0 in c:\users\menna\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\menna\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\menna\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\menna\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\menna\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [15]:
import pandas as pd
student_data = [  
    ['Alica' , 20 , 'A' , 85 ] ,
    [ 'Bob' , 22 , 'B' , 78 ] ,
    ['Charlie' , 19 , 'A' , 92 ] ,
    [ 'David' , 21 , 'C' , 65 ],
    ['Eva' , 20 , 'B' , 74 ]
]
df = pd.DataFrame(student_data,columns= [ 'Name' , 'Age' , 'Grade' , 'Marks'])
df

      Name  Age Grade  Marks
0    Alica   20     A     85
1      Bob   22     B     78
2  Charlie   19     A     92
3    David   21     C     65
4      Eva   20     B     74

In [18]:
df.head(3)

      Name  Age Grade  Marks
0    Alica   20     A     85
1      Bob   22     B     78
2  Charlie   19     A     92

In [19]:
df[['Name' , 'Marks' ]]

      Name  Marks
0    Alica     85
1      Bob     78
2  Charlie     92
3    David     65
4      Eva     74

In [20]:
excellent_students = df[df['Grade'] == 'A']
excellent_students

      Name  Age Grade  Marks
0    Alica   20     A     85
2  Charlie   19     A     92